{
    "boldizsarnagy": "Nagy Boldizsár",
    "home": "Kezdőlap",
    "portfolio": "Portfólió",
    "about": "Rólam",
    "greeting": "Üdvözöllek!",
    "greetingText": "Nagy Boldizsár vagyok, és ez az én weboldalam.",
    "past": "Múlt",
    "present": "Jelen",
    "future": "Jövő",
    "headerText": "Informatika harmadéves hallgató | Szoftverfejlesztő",
    "contactInfo": "Kapcsolat",
    "pastText": "A Groningeni Egyetemen tanultam Computer Science-t, és a szakdolgozatomat a játékelmélet és a mesterséges intelligencia területén írtam. A projekt célja egy Deep Reinforcement Learning algoritmus kifejlesztése volt zéró összegű sztochasztikus játékok megoldására. Tanulmányaim során számos projektben vettem részt, és jelentős tapasztalatot szereztem a számítástechnika területén.",
    "presentText": "Nemrég fejeztem be az alapképzést Hollandiában. Tanulmányaim befejezése után visszaköltöztem Magyarországra, és elhagytam amszterdami munkámat, ahol másfél évig dolgoztam mint szoftverfejlesztő. Most alig várom, hogy tudásomat és tapasztalataimat a magyar környezetben kamatoztassam, és továbbra is részt vegyek különböző projektekben, amelyek növelik szakértelmemet.",
    "futureText": "Célom, hogy tovább bővítsem ismereteimet a számítástechnika területén, és érdekes projekteken dolgozzak. Különösen érdekel a webfejlesztés, a mesterséges intelligencia és gépi tanulás, a Data science és még sok más. Várom, hogy hozzájárulhassak ezekhez az izgalmas területekhez.",
    "aboutMe": "Rólam",
    "aboutMeTextFirst": "Helló! Dinamikus és többnyelvű Computer Science friss diplomás vagyok, széleskörű tapasztalattal mind fizikai, mind irodai környezetben. Kiváló csapatjátékosnak tartom magam, aki könnyen épít ki erős kapcsolatokat kollégákkal és diákokkal.",
    "aboutMeTextSecond": "Nemzetközi tanulmányi és szakmai tapasztalataim egyedi perspektívát és alkalmazkodóképességet biztosítottak számomra. Szenvedélyesen törekszem arra, hogy ezeket a tapasztalatokat felhasználva mélyítsem el a tudásomat az informatikában, és jelentős mértékben hozzájáruljak a terület fejlődéséhez.",
    "aboutMeTextThird": "A szakmai munkám mellett számos személyes projektben is részt vettem, amelyek az érdeklődésemből fakadtak. Ezek a projektek lehetőséget adtak arra, hogy új technológiákat fedezzek fel, élesítsem problémamegoldó képességeimet és innovatív ötleteket valósítsak meg. Legyen szó új alkalmazás fejlesztéséről, AI algoritmusokkal való kísérletezésről vagy csak egy érdekes ötlet megvalósításáról, szeretek olyan projektekbe belevágni, amelyek kihívást jelentenek és izgalmasak számomra.",
    "aboutMeTextFourth": "A szakmai tevékenységeimen kívül szeretek új helyeket felfedezni és lépést tartani a technológia legújabb fejlesztéseivel. Mindig nyitott vagyok új lehetőségekre és együttműködésekre, amelyek kihívást jelentenek és segítenek a további fejlődésben.",
    "professionalWorkingExperience": "Szakmai tapasztalat",
    "hobbyProjects": "Hobbi projektek",
    "sourceCode": "Forráskód",
    "skills": "Készségek",
    "experiencePeriod": "{{period}}: {{company}}",
    "experienceRole": "{{role}}",
    "frontendDeveloper": "Frontend fejlesztő",
    "softwareDeveloper": "Szoftverfejlesztő",
    "description1": "Weboldalak tervezése és fejlesztése Wordpress-ben.",
    "description2": "Szoftveralkalmazások fejlesztése, karbantartása és tesztelése a cég számára. Főleg az adatbázis-konnektorokra összpontosítok.",
    "descriptionGeneticAlgorithm": "Egy program, amely genetikai algoritmus, mutációk és szaporodás segítségével találja ki a bemeneti szöveget.",
    "period2021to2022": "2021 dec. - 2022 dec.",
    "period2023toPresent": "2023 febr. - Napjainkig",
    "aboutMeText": "Szenvedélyes szoftverfejlesztő vagyok, jelenleg számítástechnikai diplomámon dolgozom. Érdeklődésem a frontend és backend fejlesztésre terjed ki, a hatékony és bővíthető megoldások létrehozására összpontosítva."
}
