{
    "home": "Kezdőlap",
    "portfolio": "Portfólió",
    "about": "Rólam",
    "greeting": "Üdvözöllek!",
    "greetingText": "Nagy Boldizsár vagyok, és ez az én weboldalam.",
    "past": "Múlt",
    "present": "Jelen",
    "future": "Jövő",
    "headerText": "Informatika harmadéves hallgató | Szoftverfejlesztő",
    "contactInfo": "Kapcsolat",
    "pastText": "Számítástechnikai területen szereztem képesítést, és számos projektben vettem részt a szakmai tapasztalataim során.",
    "presentText": "Jelenleg a Groningeni Egyetemen tanulok Számítástechnikát, és a diplomamunkámon dolgozom, amely a játékelméletet ötvözi a mesterséges intelligencia technológiákkal, mint például az Gépi Tanulás. Ezenkívül különböző projekteken dolgozom.",
    "futureText": "Remélem, hogy a jövőben bővíteni tudom tudásomat a számítástechnikai területen, és érdekes projekteken dolgozhatok. Érdeklődöm a mesterséges intelligencia és a gépi tanulás területe iránt is.",
    "aboutMe": "Rólam",
    "professionalWorkingExperience": "Szakmai tapasztalat",
    "hobbyProjects": "Hobbi projektek",
    "sourceCode": "Forráskód",
    "skills": "Készségek",
    "experiencePeriod": "{{period}}: {{company}}",
    "experienceRole": "{{role}}",
    "frontendDeveloper": "Frontend fejlesztő",
    "softwareDeveloper": "Szoftverfejlesztő",
    "description1": "Weboldalak tervezése és fejlesztése Wordpress-ben.",
    "description2": "Szoftveralkalmazások fejlesztése, karbantartása és tesztelése a cég számára. Főleg az adatbázis-konnektorokra összpontosítok.",
    "descriptionGeneticAlgorithm": "Egy program, amely genetikai algoritmus, mutációk és szaporodás segítségével találja ki a bemeneti szöveget.",
    "period2021to2022": "2021 dec. - 2022 dec.",
    "period2023toPresent": "2023 febr. - Napjainkig",
    "aboutMeText": "Szenvedélyes szoftverfejlesztő vagyok, jelenleg számítástechnikai diplomámon dolgozom. Érdeklődésem a frontend és backend fejlesztésre terjed ki, a hatékony és bővíthető megoldások létrehozására összpontosítva."
}
