{
    "boldizsarnagy": "Boldizsár Nagy",
    "home": "Home",
    "portfolio": "Portfolio",
    "about": "About",
    "greeting": "Welcome!",
    "greetingText": "My name is Boldizsár Nagy and this is my website.",
    "past": "Past",
    "present": "Present",
    "future": "Future",
    "headerText": "Computer Science Graduate | Software Developer",
    "contactInfo": "Contact Information",
    "professionalWorkingExperience": "Professional Working Experience",
    "hobbyProjects": "Hobby Projects",
    "sourceCode": "Source code",
    "skills": "Skills",
    "experiencePeriod": "{{period}}: {{company}}",
    "experienceRole": "{{role}}",
    "frontendDeveloper": "Junior Full-Stack Developer",
    "softwareDeveloper": "Junior Software Engineer",
    "description1": "Design and developed websites in Wordpress.",
    "description2": "Develop, maintain and test software applications for the company. Mostly focusing on database connectors.",
    "descriptionGeneticAlgorithm": "A program that guesses an input string using genetic algorithm, mutations and breeding.",
    "period2021to2022": "2021 Dec - 2022 Dec",
    "period2023toPresent": "2023 Feb - 2024 Aug",
    "pastText": "I studied Computing Science at the University of Groningen and worked on my thesis in the field of game theory coupled with artificial intelligence. The goal of my project was to develop a Deep Reinforcement Learning algorithm to solve zero-sum Stochastic Games. During my education, I participated in various projects and gained substantial experience in computing science.",
    "presentText": "I recently finished my Bachelor's degree in Computing Science in the Netherlands. After completing my studies, I moved back to Hungary, leaving my job in Amsterdam where I worked for 1.5 years as a software developer. I now look forward to applying my knowledge and experience in the Hungarian environment and continue to engage in various projects that enhance my expertise.",
    "futureText": "I aim to broaden my knowledge in computing science further and work on intriguing projects. I am particularly interested in the fields of web development, artificial intelligence and machine learning, data science and much more. I look forward to contributing to advancements in these interesting areas.",
    "aboutMe": "About me",
    "aboutMeTextFirst": "Hello! I'm a dynamic and multilingual computer science graduate with a broad range of experience in both physical and office environments. I pride myself on being an excellent team player, capable of easily establishing strong relationships with colleagues and fellow students.",
    "aboutMeTextSecond": "My international academic and professional experiences have provided me with a unique perspective and adaptability. I am passionate about leveraging these experiences to deepen my expertise in computer science and contribute meaningfully to the field.",
    "aboutMeTextThird": "In addition to my professional work, I've also engaged in various personal projects driven by my interests. These projects have allowed me to explore new technologies, sharpen my problem-solving skills, and bring innovative ideas to life. Whether it's developing a new app, experimenting with machine learning algorithms, or building a cool gadget, I love diving into projects that challenge and excite me.",
    "aboutMeTextFourth": "Outside of my professional pursuits, I enjoy exploring new places and staying updated with the latest advancements in technology. I am always open to new opportunities and collaborations that challenge me and help me grow further in my career."
}