{
    "boldizsarnagy": "Boldizsár Nagy",
    "home": "Home",
    "portfolio": "Portfolio",
    "about": "About",
    "greeting": "Welcome!",
    "greetingText": "My name is Boldizsár Nagy and this is my website.",
    "past": "Past",
    "present": "Present",
    "future": "Future",
    "headerText": "Computer Science 3rd Year Student | Software Developer",
    "contactInfo": "Contact Information",
    "pastText": "I have education in the field of computing science and have worked in various projects during my professional working experience. I have also been involved in various projects and have gained experience in the field of computing science.",
    "presentText": "I am currently studying Computing Science at the University of Groningen and am working on my thesis in the field of game theory coupled with artificial intelligence techniques such as reinforcement learning. I am also working on various projects in the field of computing science.",
    "futureText": "I hope to broaden my knowledge in the field of computing science and to work on interesting projects in the future. I am also interested in the field of artificial intelligence and machine learning.",
    "aboutMe": "About me",
    "professionalWorkingExperience": "Professional Working Experience",
    "hobbyProjects": "Hobby Projects",
    "sourceCode": "Source code",
    "skills": "Skills",
    "experiencePeriod": "{{period}}: {{company}}",
    "experienceRole": "{{role}}",
    "frontendDeveloper": "Frontend Developer",
    "softwareDeveloper": "Software Developer",
    "description1": "Design and developed websites in Wordpress.",
    "description2": "Develop, maintain and test software applications for the company. Mostly focusing on database connectors.",
    "descriptionGeneticAlgorithm": "A program that guesses an input string using genetic algorithm, mutations and breeding.",
    "period2021to2022": "2021 Dec - 2022 Dec",
    "period2023toPresent": "2023 Feb - Present",
    "aboutMeText": "I am a passionate software developer currently pursuing a degree in Computer Science. My interest lies in both frontend and backend development, with a focus on creating efficient and scalable solutions."
}